app/controllers/todos_controller.rb

  def index
  	 @todo_items=Todo.all
---
SELECT "todos".* FROM "todos"

 def add
 	todo = Todo.create(:todo_item => params[:todo][:todo_item],:deadLine =>Time.now)
---
INSERT INTO "todos" ("created_at", "deadLine", "todo_item", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-05-04 03:45:03.349669"], ["deadLine", "2015-05-03"], ["todo_item", "tarea de gran escala"], ["updated_at", "2015-05-04 03:45:03.349669"]]

   def complete
   	if params[:commit] == "Complete Todos"
		params[:todos_checkbox].each do |check|
			todo_id = check
			t = Todo.find_by_id(todo_id)
		    t.update_attribute(:completed, true)
		    t.update_attribute(:deadLine, nil)
		end
	elsif params[:commit] == "Delete"
	  if params[:todos_checkbox] != nil
	  	  ids = params[:todos_checkbox].collect {|id| id.to_i}
		  ids.each do |id|
			Todo.where(:id =>id).destroy_all
---
SELECT  "todos".* FROM "todos"  WHERE "todos"."id" = 1 LIMIT 1
UPDATE "todos" SET "completed" = ?, "updated_at" = ? WHERE "todos"."id" = 1  [["completed", "t"], ["updated_at", "2015-05-04 01:12:28.048469"]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 1]]